Config/Catalogs/РеквизитыСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыСведенийОбИмуществе</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыКартСведенийОбИмуществе</xr:Item>
				<xr:Item>Catalog.ВидыОбъектовРеестраИмущества</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРеквизита</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРеквизитовСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРеквизитовСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отображение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РастягиватьПоВертикали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РастягиватьПоГоризонтали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаРегулирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаОткрытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйВыбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаЗаполнение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаОбязательность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаНедоступность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыРеквизитовСведенийОбИмуществе</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ВидыРеквизитовСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРеквизитовСведенийОбИмуществе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекорацияНадпись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Идентификатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеВвода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеНадписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеПереключателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеФлажка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокЗначенийПолеВвода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокЗначенийПолеНадписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокЗначенийТаблица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбычнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаКолонок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/РеквизитыФормыСпискаСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыФормыСпискаСведенийОбИмуществе</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.РеквизитыСведенийОбИмуществе</xr:Item>
				<xr:Item>Catalog.ВидыОбъектовРеестраИмущества</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитТаблицы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/РеквизитыСведенийОбИмуществе/Forms/ФормаГруппы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьДеревоОперандов();
	
	УстановитьОтборПоВладельцу();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Справочники.РеквизитыФормыСпискаСведенийОбИмуществе);
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаПереместить;	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьНастройкуЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Элементы.СтраницаФормаТаблицы.Доступность Тогда
		ТекущийОбъект.РедактироватьВДиалоге = Ложь;
		УдалитьРеквизитыТаблицы();
	КонецЕсли;
	
	Если Не Элементы.СтраницаФормулы.Доступность Тогда
		ТекущийОбъект.ФормулаЗаполнение		= "";
		ТекущийОбъект.ФормулаОбязательность	= "";
		ТекущийОбъект.ФормулаНедоступность	= "";
		ТекущийОбъект.ФормулаКомментарий	= "";
		ТекущийОбъект.Обязательное			= Ложь;
		ТекущийОбъект.Недоступное			= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеквизитыТаблицы, "Реквизит", Объект.Ссылка, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовЗакладкиОсновныеСведения

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	РеестрИмуществаКлиентСервер.УстановитьИмяДляФормулы(Объект.ИмяДляФормулы, Объект.Наименование);

КонецПроцедуры

&НаКлиенте
Процедура ИмяДляФормулыПриИзменении(Элемент)
	
	РеестрИмуществаКлиентСервер.УстановитьИмяДляФормулы(Объект.ИмяДляФормулы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРеквизитаПриИзменении(Элемент)
	
	ГруппировкаСписокВыбора();
    ОтображениеГруппыСписокВыбора();
	РастягиватьПоГоризонталиСписокВыбора();
	СтраницыТаблицыДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовЗакладкиФормулы

&НаКлиенте
Процедура ОбязательноеПриИзменении(Элемент)
	
	УправлениеДоступностьюФормулойОбязательность();
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура НедоступноеПриИзменении(Элемент)
	
	УправлениеДоступностьюФормулойНедоступность();
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперандыФормулНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	#Если ВебКлиент Тогда
		Выполнение = Ложь;
		Возврат;
	#КонецЕсли
	
	ЗначениеПеретаскивания = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(ЗначениеПеретаскивания) = Тип("Массив") И ЗначениеПеретаскивания.Количество()>0 Тогда
		ТекущееЗначение = ОперандыФормул.НайтиПоИдентификатору(ЗначениеПеретаскивания[0]);
	ИначеЕсли ТипЗнч(ЗначениеПеретаскивания) = Тип("Число") Тогда
		ТекущееЗначение = ОперандыФормул.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	Иначе
		Выполнение = Ложь;	
	КонецЕсли;
	Если ТекущееЗначение <> Неопределено Тогда
		ПараметрыПеретаскивания.Значение = ТекущееЗначение.ИмяДляФормулы;
	Иначе
		Выполнение = Ложь;
	КонецЕсли;                                                                        
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСтраницыФормулыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВФормулу(Команда)
	
	ТекущиеДанные = Элементы.ОперандыФормул.ТекущиеДанные;
	ИмяЭлемента = Сред(Элементы.СтраницаСтраницыФормулы.ТекущаяСтраница.Имя, 9);
	Если ТекущиеДанные <> Неопределено Тогда
		Объект[ИмяЭлемента] = Объект[ИмяЭлемента] + ТекущиеДанные.ИмяДляФормулы;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ФормаСписка);	
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ФормаСписка, Результат);	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ФормаСписка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();	
	Справочники.РеквизитыСведенийОбИмуществе.УстановитьУсловноеОформлениеФормы(УсловноеОформление);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОперандов()
	
	Дерево = Справочники.РеквизитыСведенийОбИмуществе.ЗаполнитьДеревоОперандов(Объект);	
	ЗначениеВРеквизитФормы(Дерево, "ОперандыФормул");
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуЭлементовФормы()
	
	ВидРеквизитаСписокВыбора();
	ГруппировкаСписокВыбора();
    ОтображениеГруппыСписокВыбора();
	РастягиватьПоГоризонталиСписокВыбора();
	СтраницыТаблицыДоступность();
	
	УправлениеДоступностьюФормулойОбязательность();
	УправлениеДоступностьюФормулойНедоступность();
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРеквизитаСписокВыбора()
	
	Список = Элементы.ВидРеквизита.СписокВыбора;	
		
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ОбычнаяГруппа"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Страница"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Страницы"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Таблица"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСписокВыбора()
	
	Список = Новый СписокЗначений;
	
	Если Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ОбычнаяГруппа")
		Или Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Страница") Тогда
		Список.Добавить(0, "Вертикальная");
		Список.Добавить(1, "Горизонтальная");
	//ИначеЕсли Объект.ВидРеквизита = 4 Тогда
	//	Список.Добавить(1, "Горизонтальная");	
	//	Список.Добавить(0, "Вертикальная");
	//	Список.Добавить(2, "В ячейке");
	Иначе	
		// Пустой список
	КонецЕсли;
	
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.Группировка, Объект.Группировка, Список);
			
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеГруппыСписокВыбора()
	
	Список = Новый СписокЗначений;
	
	Если Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ОбычнаяГруппа") Тогда
		Список.Добавить(0, "Нет");
		Список.Добавить(1, "Рамка группы");
		Список.Добавить(2, "Линия");
		Список.Добавить(3, "Отступ");
	ИначеЕсли Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Страницы") Тогда
		Список.Добавить(1, "Нет");
		Список.Добавить(0, "Закладки сверху");
		Список.Добавить(2, "Закладки снизу");
		Список.Добавить(3, "Закладки слева (горизонтально)");		
		Список.Добавить(4, "Закладки справа (горизонтально)");		
	ИначеЕсли Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Таблица") Тогда
		Список.Добавить(0, "Список");
		Список.Добавить(1, "Иерархический список");
		Список.Добавить(2, "Дерево");
	Иначе
		// Пустой список
	КонецЕсли;
	
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.Отображение, Объект.Отображение, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура РастягиватьПоГоризонталиСписокВыбора()
	
	Список = Новый СписокЗначений;
	
	Если Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Таблица") Тогда
		Список.Добавить(0, "Да");
		Список.Добавить(1, "Нет");		
	Иначе
		Список.Добавить(1, "Да");
		Список.Добавить(2, "Нет");
		Список.Добавить(0, "Авто");
	КонецЕсли;
	
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.РастягиватьПоГоризонтали, Объект.РастягиватьПоГоризонтали, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыТаблицыДоступность()
	
	ЭтоТаблица = (Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Таблица"));	
	
	Элементы.СтраницаФормулы.Доступность	  = ЭтоТаблица;
	Элементы.СтраницаФормаТаблицы.Доступность = ЭтоТаблица;		
	
КонецПроцедуры

 &НаСервере
Процедура УстановитьОтборПоВладельцу()
	
	НевыводимыеРеквизиты = Новый Массив;
	НевыводимыеРеквизиты.Добавить(Перечисления.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись);
	НевыводимыеРеквизиты.Добавить(Перечисления.ВидыРеквизитовСведенийОбИмуществе.Идентификатор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеквизитыТаблицы, "Реквизит", Объект.Ссылка, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеквизитыТаблицы, "НевыводимыеРеквизиты", НевыводимыеРеквизиты, Истина); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ФормаСписка.Отбор, "Владелец", Объект.Ссылка,,, Истина);	

КонецПроцедуры


&НаКлиенте
Процедура ФормаСпискаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
			
	СоздатьРеквизитыФормыСписка(Строка, ПараметрыПеретаскивания.Значение);
		
	ОповеститьОбИзменении(Тип("СправочникСсылка.РеквизитыФормыСпискаСведенийОбИмуществе"));

КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыФормыСписка(Родитель, Реквизиты)
	
	Для Каждого Реквизит Из Реквизиты Цикл
		
		НовыйЭлемент = Справочники.РеквизитыФормыСпискаСведенийОбИмуществе.СоздатьЭлемент();
		НовыйЭлемент.Владелец = Объект.Ссылка;
		НовыйЭлемент.Родитель = Родитель;
		НовыйЭлемент.РеквизитТаблицы = Реквизит;
		НовыйЭлемент.Наименование = Реквизит.Наименование;
		НовыйЭлемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюФормулойОбязательность()
	
	Элементы.ФормулаОбязательность.ТолькоПросмотр = Объект.Обязательное;	
	Элементы.ДекорацияОбязательность.Заголовок = ?(Объект.Обязательное, "Поле обязательно для заполения", "Обязательность заполнения поля определяется по формуле");		
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюФормулойНедоступность()
	
	Элементы.ФормулаНедоступность.ТолькоПросмотр = Объект.Недоступное;
	Элементы.ДекорацияНедоступность.Заголовок = ?(Объект.Недоступное, "Поле ограничено для редактирования", "Доступность редактирования поля определяется по формуле");
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюКнопкиДобавитьВФормулу()
	
	КнопкаДоступна = Истина;
	
	Если Элементы.СтраницаСтраницыФормулы.ТекущаяСтраница = Элементы.СтраницаФормулаОбязательность Тогда
		КнопкаДоступна = Не Объект.Обязательное;
	ИначеЕсли Элементы.СтраницаСтраницыФормулы.ТекущаяСтраница = Элементы.СтраницаФормулаНедоступность Тогда
		КнопкаДоступна = Не Объект.Недоступное;
	КонецЕсли;
	
	Элементы.ДобавитьВФормулу.Доступность = КнопкаДоступна;
	
КонецПроцедуры


&НаСервере
Процедура УдалитьРеквизитыТаблицы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеквизитыФормыСпискаСведенийОбИмуществе.Ссылка
	               |ИЗ
	               |	Справочник.РеквизитыФормыСпискаСведенийОбИмуществе КАК РеквизитыФормыСпискаСведенийОбИмуществе
	               |ГДЕ
	               |	РеквизитыФормыСпискаСведенийОбИмуществе.Владелец = &Владелец
	               |	И НЕ РеквизитыФормыСпискаСведенийОбИмуществе.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РеквизитФормыСписка = Выборка.Ссылка.ПолучитьОбъект();
		РеквизитФормыСписка.ПометкаУдаления = Истина;
		РеквизитФормыСписка.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
